{
    "location": "Mountain View, United States",
    "time": "2024-09-18 17:02:50 [America/Los_Angeles]",
    "chain_of_thought": [
        {
            "code": "# This request is best satisfied by the Python libraries for 'browsing' and 'google_hotels'.\n# I already know API descriptions for all of them.\n# Let's call browse to get more context of what the user is referring to\nprint(browsing.browse(query=\"Can you summarize this article for me?\", url=\"https://thepointsguy.com/guide/best-hawaii-resorts-hotels/\"))",
            "tool_executions": [
                {
                    "tool_name": "browsing_tool",
                    "method_name": "browse",
                    "params": {
                        "query": "Can you summarize this article for me?",
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/"
                    },
                    "output": {
                        "content_summary": [
                            "Best resort hotels in Hawaii - The Points Guy [SNIPPET] Best resort hotels in Hawaii - The Points Guy  Skip to content  Menu  Go to Home Page  Advertiser disclosure  SUBSCRIBE  News Credit Cards  Card Type  Best overall Travel Airlines Rewards Business Cash back All credit cards  Card Issuer  American Express Chase Capital One Citi Bank of America All issuers  Cobranded Cards  American Airlines Delta Air Lines Hilton Marriott Southwest Airlines United Airlines All cobranded cards  Learn About Credit Cards  Beginners guide Credit score Credit utilization Credit card reviews  Points + Miles  Credit Card Reward Programs  American Express Membership Rewards Capital One Rewards Chase Ultimate Rewards Citi ThankYou Rewards All credit card programs  Airline Reward Programs  American AAdvantage Delta SkyMiles Southwest Rapid Rewards United MileagePlus All airline programs  Hotel Reward Programs  Hilton Honors Marriott Bonvoy World of Hyatt IHG One Rewards All hotel programs  Learn About Reward Programs  Beginners guide to points and miles TPG points valuations Award vs. cash calculator  Travel  Airlines  Airline news Airline reviews Airline deals All airline stories  Hotels  Hotel news Hotel reviews Hotel deals All hotel stories  Cruises  All cruise stories  Resources  Family travel Road trips Travel gear Travel advisories Travel tips  Tools  TPG app  Improve earnings, maximize rewards and track progress toward dream trips. Plus, your own feed of TPG content.  TPG points valuation  See what a point or mile is worth with our appraisals of a loyalty program's currency, based on redemption values.  Award vs. cash calculator  Check here before booking an award fare. Compare the cost in points or miles to cash, and see which option is best.  CardMatch  Find the right card for you. We'll run a soft credit check to find special offers, but it won't affect your credit score.  SUBSCRIBE  Advertiser disclosure  Search The Points Guy  SUBSCRIBE  Advertiser disclosure  ADVERTISEMENT  Guide  Best hotels and resorts in Hawaii  Kathryn Romeyn  Kathryn Romeyn  Contributor  Kathryn Romeyn is a travel and design journalist living in Bali, Indonesia, who travels frequently with her husband and toddler. She contributes to The Points Guy, plus a variety of other publications, and co-hosts Conscious Traveler, a podcast inspiring meaningful exploration through stories of culture, conservation and community. Kathryn packs her Canon DSLR for every trip and seeks out remarkable landscapes and wildlife, fascinating cultures, Neapolitan-style pizza and long, left-handed waves.  April 18, 2023  •  25 min read  Best Hawaii Hotel_Fairmont Orchid_FB  Jump to section  Facebook  Twitter  LinkedIn  Copy URL  Email  The cards we feature here are from partners who compensate us when you are approved through our site, and this may impact how or where these products appear. We don't cover all available credit cards, but our analysis, reviews, and opinions are entirely from our editorial team. Terms apply to the offers listed on this page. Please view our advertising policy and product review methodology for more information.  Although it's part of the U.S., a trip to Hawaii feels like visiting another country, thanks to the islands' otherworldly landscapes and the vibrant Hawaiian culture. Even from one island to the next, visitors are bound to discover differences. The same goes for hotels and resorts, too.  Some are contemporary and sleek, while others lean into the romantic notion of old Hawaii, with native materials and traditional styling. There are options at a wide range of price points and points values, too. From escapes with easy access to the best Hawaii beaches to retreats that offer postcard-perfect experiences all year long (there really is no best time to visit Hawaii, after all), the possibilities are practically endless in the United States' most tropical destination.  On the best islands in Hawaii, here are the 18 very best resorts and hotels and what not to miss at each.  ADVERTISEMENT  Oahu  Turtle Bay  Kahuku, Oahu, Hawaii, USA  TURTLE BAY RESORT/FACEBOOK  Best for: Freewheeling access to nearly 1,300 pristine acres of paradise on Oahu's North Shore.  Why stay here: The landmark luxury hotel on Oahu's coast reopened in 2021 after a total transformation that enhanced its lush, laid-back vibes while elevating its food and beverage experiences.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Get updates on special offers and compare our editors' top credit card picks with our daily newsletter.  There's no doubt $250 million dollars can do a lot for a hotel. But in the case of Turtle Bay Resort, the iconic and sole luxury resort on Oahu's North Shore, that substantial investment makes it feel almost like a new property was unveiled in 2022.  The 50th birthday, down-to-the-studs face-lift is evident in multitudinous ways across the sprawling nature reserve-like resort, which has an abundance of pristine waterfront (including world-class surf breaks) and also hiking and horseback riding trails.  From arrival, the great island outdoors are front and center, and the 408 refreshed guest rooms and suites embrace it wholly. For a splurge, opt for one of the 42 stand-alone beachfront bungalows, which come with access to a new shared swimming pool.  ADVERTISEMENT  No Hawaiian holiday is complete without a traditional lomi lomi massage, and the spa, with soaring glass walls, is a definite highlight here. It clocks in at 11,000 square feet, including a state-of-the-art fitness center, and offers mud masks, wraps and more — all featuring sustainable ingredients so there's no guilt associated with your pampering.  The new Turtle Bay is also a dining destination in its own right. There is a fresh focus on just-harvested-from-the-farm ingredients such as hydroponic greens that come straight from the resort's Kuilima Farm, as well as seafood sourced from local waters. Eight dining outlets include the signature restaurant, Alaia, housemade mixology-focused lobby bar, Off The Lip, and an al fresco dinner series called Paniolo Luau that serves as an ode to Hawaiian cowboys, with roasted meats for mains, hula lessons and storytelling, among other cultural activities.  Rates at Turtle Bay Resort currently start at $599 per night.  Inline Wiget Buildings Image  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  First name  Last name  Get started  Halekulani Hotel  Honolulu, Oahu, Hawaii, USA  BRANDON BARRE/HALEKULANI HOTEL/FACEBOOK  Best for: Heavenly indulgence in a prized part of Waikiki with clear views of Diamond Head.  Why stay here: For more than a century this oceanfront hotel has offered itself to chic travelers as a sanctuary of world-class cuisine, next-level wellness and gracious hospitality.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Much has changed at Halekulani in its century-plus existence, but a lot hasn't, which is part of its timeless magic. The quiet location, for one, is as fabulous as it's always been, with perfect turquoise ocean panoramas from most of the rooms.  That palette dominates the otherwise serene white-on-white interiors, especially in the 453 guest rooms and suites, which have separate showers and tubs in the bathrooms, large balconies and welcome amenities, as well as turndown service with house-made chocolates.  It's the hotel's mission to leave its guests wanting for nothing, and in that spirit, the culinary offerings are especially robust and memorable. There's La Mer, with tinges of French flair, which feels especially romantic, and the coastal Italian restaurant Orchids, where three meals a day — plus throwback afternoon tea — are served alongside Waikiki Beach views. House Without A Key has nightly local music and a brick oven, plus a new pool bar, Earl's, where one truly feels on vacation after a coconut-cake martini.  Card Illustration  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  Try CardMatch  A popular wedding venue, Halekulani has elements including an integrated spa with a full menu of physical healing services, mindfulness practices and beauty services to get you ready for the big day.  Rates at Halekulani currently start at $665 per night.  The Kahala Hotel & Resort  Honolulu, Oahu, Hawaii, USA  THE KAHALA HOTEL/FACEBOOK  Best for: Luxurious seclusion just 10 minutes from Waikiki.  Why stay here: This 1964 high-rise still has its sheen, thanks to its guest roster of royals and A-listers, a chef of Michelin acclaim, Diamond Head views and a lagoon brimming with bottlenose dolphins.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Known as the \"Ka-Hollywood\" for its robust roster of A-list guests, this resort just outside of the bustle of Waikiki has perfected the art of discretion. But even if you're not someone the paparazzi is chasing, the always attentive service and regal amenities are sure to make you feel special.  This is arguably the only place in Honolulu where you may see bottlenose dolphins jumping outside from the comfort of your king bed — and that's from many of the rooms, not even a signature suite. With 338 total residential-style accommodations done up in soothing pastel hues, there's an only-in-Hawaii view for all.  Acclaimed executive chef Jonathan Mizukami oversees the hotel's five distinctive dining destinations, which include the fine dining restaurant Hoku's, where dishes are almost too pretty to eat. If those grand tasting menus are too profuse, the other options are plentiful. There's lounge-y and elevated The Veranda, the casual Seaside Grill, the beachfront Plumeria Beach House and Italian mecca Arancino.  Families celebrating special occasions can take home forever memories by booking photo shoots across the property's many picturesque spots, such as the sugary 800-foot beach where guests can count on complimentary lounge chairs and can also rent kayaks, snorkeling gear, boogie boards and stand-up paddleboards.  ADVERTISEMENT  If you're active, there are bike rentals, a Kahala jogging map, stand-up paddleboard yoga sessions and daily yoga and fitness classes. Of course, for those seeking the opposite, the Kahala Spa seeks to coddle via massages with warm pohaku stones or maybe a lomi stick foot massage followed by a tropical pedicure.  Rates at The Kahala Hotel & Resort currently start at $495 per night.  The Laylow  Honolulu, Oahu, Hawaii, USA  THE LAYLOW/MARRIOTT.COM  Best for: Midcentury modern aficionados seeking a lively scene both day and night.  Why stay here: The Instagrammable design, tech-friendly amenities, saltwater pool and welcoming pet policy makes this Waikiki bolthole a guaranteed good time.  Best way to book: Book directly with Marriott to earn or redeem Marriott Bonvoy points and enjoy any elite benefits.  Book now  When the ocean isn't right out the window, design tends to take center stage, as is the case at this downtown Waikiki boutique hotel that harks to the classic 1960s visually. Even with the beach blocks away, there's a strong sense of Hawaii in the spirited wallpapers, artwork and furniture decorating its 251 midcentury-esque rooms and suites.  And perks of the Laylow's location go beyond easy foot access to plentiful restaurants and shops. Complimentary cultural lessons are on offer for an hour every morning. Ukulele, anyone? There are fire pits on a verdant rooftop garden bursting with native flora, an aesthetic that extends to Hideout, a greenhouse-themed restaurant that serves modern Hapa Hawaiian cuisine and even has a bar with live entertainment every single night. This chic urban jungle of a hotel is also home to three independently operated restaurants dishing out global fare that might transport you anywhere from South Korea to Texas.  Proudly pet-friendly, it's a place for travelers of all stripes — especially those who love a saltwater swimming pool, another milieu with lush landscaping as well as half-submerged loungers for achieving the perfect tan while staying cool. It's almost like you don't need to bother with the beach.  Rates at The Laylow, Autograph Collection currently start at $332 or 57,000 points per night.  Aulani, A Disney Resort & Spa  Kapolei, Oahu, Hawaii, USA  AULANI, A DISNEY RESORT AND SPA/FACEBOOK  Best for: Kids and kids-at-heart ready to dive into all the Disneyfied wonders of Oahu.  Why stay here: This haven for little ones delivers magic during every stay, as well as ease, thanks to the complimentary kids club, on-resort entertainment and, yes, a spa.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  As much as Hawaii is for honeymooners, it's also for families. Let's be honest, no one enjoys all that sand and water as much as children. And nowhere is more of a magnet for them than Aulani, which is a collaboration between Walt Disney Imagineers, Hawaiian artisans and cultural experts.  The resort name means \"messenger of a chief,\" and it indeed brings Hawaiian culture to life in captivating ways for all ages on Oahu's leeward coast in the Ko Olina development. The property comprises not only 325 hotel rooms and 16 suites, but 481 Disney Vacation Club units and grand villas as well.  The 5,200-square-foot kids club is named appropriately for its location: Aunty's Beach House, and for children ages 4 to 12 there are complimentary supervised activities, including Hawaiian arts and crafts. Further experiences on-site include hula lessons and lei making, while evenings bring fireside storytelling and outdoor movie nights under the very stars ancient wayfinders used to reach..."
                        ],
                        "relevant_contents": [
                            "Traveler, a podcast inspiring meaningful exploration through stories of culture, conservation and community. Kathryn packs her Canon DSLR for every trip and seeks out remarkable landscapes and wildlife, fascinating cultures, Neapolitan-style pizza and long, left-handed waves.  April 18, 2023  •  25 min read  Best Hawaii Hotel_Fairmont Orchid_FB  Jump to section  Facebook  Twitter  LinkedIn  Copy URL  Email  The cards we feature here are from partners who compensate us when you are approved through our site, and this may impact how or where these products appear. We don't cover all available credit cards, but our analysis, reviews, and opinions are entirely from our editorial team. Terms apply to the offers listed on this page. Please view our advertising policy and product review methodology for more information.  Although it's part of the U.S., a trip to Hawaii feels like visiting another country, thanks to the islands' otherworldly landscapes and the vibrant Hawaiian culture. Even from one island to the next, visitors are bound to discover differences. The same goes for hotels and resorts, too.  Some are contemporary and sleek, while others lean into the romantic notion of old Hawaii, with native materials and traditional styling. There are options at a wide range of price points and points values, too. From escapes with easy access to the best Hawaii beaches to retreats that offer postcard-perfect experiences all year long (there really is no best time to visit Hawaii, after all), the possibilities are practically endless in the United States' most tropical destination.  On the best islands in Hawaii, here are the 18 very best resorts and hotels and what not to miss at each.  ADVERTISEMENT  Oahu  Turtle Bay  Kahuku, Oahu, Hawaii, USA  TURTLE BAY RESORT/FACEBOOK  Best for: Freewheeling access to nearly 1,300 pristine acres of paradise on Oahu's North Shore.  Why stay here: The landmark luxury hotel on Oahu's coast reopened in 2021 after a total transformation that enhanced its lush, laid-back vibes while elevating its food and beverage experiences.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Get updates on special offers and compare our editors' top credit card picks with our daily newsletter.  There's no doubt $250 million dollars can do a lot",
                            "alike in Kapalua Bay is a true reflection of its immediate surroundings. Renovated in 2022, The Ritz-Carlton Maui, Kapalua is currently at the top of its game. And that game is spot-on service and top-of-the-line luxury.  There are 466 rooms, suites and residences spread across 54 acres. Each has a private balcony, often with some breathtakingly vibrant vista just beyond, plus huge bathrooms with generous bathtubs and Diptyque toiletries.  Appropriately for such a sprawling property, there are six dining outlets. The Banyan Tree celebrates unique and sustainable Maui-sourced ingredients, Alaloa Lounge does light bites with cocktails as special as its sunsets, Olu Cafe is the place for tasty lunches of pupus and salads, and Burger Shack is self-explanatory (with milkshakes to boot). There's also Ulana for rich breakfasts and Kai Cafe for on-the-go bites and picnics.  The spa is worthy of spending an entire day, complete with saunas, whirlpools and steam rooms. But there's also so much to do under the Maui sun, like exploring a truly massive three-tiered swimming pool with cabanas, going kayaking and hitting some balls around at the tennis courts. There's a Ritz Kids program, and this is one of just five Ritz-Carlton hotels with a Jean-Michel Cousteau's Ambassadors of the Environment program outpost, which offers fun and enlightening family-friendly experiences that turn the resort into Mother Nature's classroom.  Rates at The Ritz-Carlton Maui, Kapalua currently start at $812 or 80,000 Marriott Bonvoy points per night.  Grand Wailea Maui  Wailea, Maui, Hawaii, USA  GRAND WAILEA MAUI  Best for: An island stay that immerses you in Hawaiian culture and flavors.  Why stay here: The Grand Wailea Maui's gorgeous grounds, world-renowned spa, proximity to Wailea Beach and unique collection of pools make it a prime choice for a Hawaii family beach escape.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits or directly with Hilton to redeem Hilton Honors points.  Book now  Sometimes bigger really is better. Like at this behemoth resort with voluptuous Fernando Botero sculptures and 776 crisp and colorful rooms and villas that start at a spacious 650 square feet. The spa is Hawaii's largest, with 40 treatment rooms, and the kids club is a gigantic 20,000 square feet, with plenty of activities to engage kids with diverse interests.  You need only look at the creative labyrinth of swimming pools, dubbed the Wailea Canyon Activity Pool, to understand why this resort is hugely popular with families. It spans six different levels connected by slides, a river with both rapids and gentle currents, waterfalls, caves and the world's first and only water elevator. Adventures are guaranteed. For adults, however, the giant Hibiscus Pool, inlaid with more than 2 million individual tiles, is a place for tranquility.  Grand Wailea has a scuba provider offering complimentary pool lessons to beginners, and Aqualani rents paddleboards. Outrigger tours are available to book, with specialized sessions for turtle watching, snorkeling and whale watching. The daily resort fee of $50 covers a generous number of extras, including one 45-minute photography session per stay, plus morning yoga classes, beach cruisers, ukulele lessons and beach umbrellas.  For fuel, guests can enjoy sushi in the Botero Lounge, pina coladas from Wailea Surf Haus and wood-fired pizzas from Aloha Trick Pony, among the half-dozen options. The signature restaurant, however, is Humuhumunukunukupuaa, which serves Hawaiian-caught seafood overlooking the Pacific.  Rates at Grand Wailea Maui, A Waldorf Astoria Resort currently start at $892 or 110,000 Hilton Honors points per night.  Hawaii Island  Mauna",
                            "the first year, then $150. Delta SkyMiles® Gold American Express Card Members get 15% off when using miles to book Award Travel on Delta flights through delta.com and the Fly Delta app. Discount not applicable to partner-operated flights or to taxes and fees. $200 Delta Flight Credit: After you spend $10,000 in purchases on your Card in a calendar year, you can receive a $200 Delta Flight Credit to use toward future travel. Earn 2X Miles on Delta purchases, at U.S. Supermarkets and at restaurants worldwide, including takeout and delivery in the U.S. Earn 1X Miles on all other eligible purchases. You can check your first bag free on Delta flights, saving up to $70 on a round-trip Delta flight per person. For a family of four that's a potential savings of up to $280 per round-trip flight. Receive Zone 5 Priority Boarding on Delta flights; board early, stow your carry-on bag and settle in sooner. $100 Delta Stays Credit: Get up to $100 back per year as a statement credit after using your Delta SkyMiles® Gold American Express Card to book prepaid hotels or vacation rentals through Delta Stays on delta.com. Take up to $50 off the cost of your flight for every 5,000 miles you redeem with Pay with Miles when you book on delta.com. Receive a 20% savings in the form of a statement credit on eligible Delta in-flight purchases after using your Card. No Foreign Transaction Fees. With Send & Split®, you can send money and split your Card purchases with any other Venmo or PayPal user, directly from the Amex App. Enroll today. Terms Apply. See Rates & Fees  Maximize your travel  Facebook  Instagram YouTube Twitter TikTok  Sign up for our daily newsletter for the latest news, deals and tips.  Email address  Sign up  I would like to subscribe to The Points Guy newsletters and special email promotions. The Points Guy will not share or sell your email. See PRIVACY POLICY.  Meet TPG  About us TPG gives back Careers Contact us Site map Newsletters  Legal  Do Not Sell or Share My Personal Information Privacy policy Terms of use Cookie settings Consumer Health Data Privacy Policy  Our Commitment to Transparency  The Points Guy believes that credit cards can transform lives, helping you leverage everyday spending for cash back or travel experiences that might otherwise be out of reach. That's why we publish a variety of editorial content and card comparisons: to help you find a great card to turn your goals into reality.  When you choose to apply (and are approved) for a new credit card through our site, we may receive compensation from our partners, and this may impact how or where these products appear. While we don't cover all available credit cards, our editorial team creates and maintains all of the analysis of these cards, and our content is not influenced nor subject to review by any credit card company, bank or partner prior to (or after) publication. Please view our advertising policy and product review methodology for more information.  Copyright © 2024 The Points Guy, LLC. All rights reserved. A Red Ventures company. "
                        ],
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/",
                        "url_fetch_statuses": [
                            "URL_FETCH_STATUS_SUCCESS"
                        ]
                    }
                }
            ],
            "error": "",
            "observation": "This is an article about the best resort hotels in Hawaii. It discusses Oahu, Maui, and the Big Island [Oahu: 8, Maui: 36, Big Island: 45]. The article highlights the best aspects of each hotel ranging from activities to dining [e.g. Turtle Bay: 11, Halekulani: 15, Grand Wailea: 44]. Foolproof ways to book the best rates are also given [e.g. Turtle Bay: 8, Halekulani: 13].\n"
        },
        {
            "code": "# This webpage is about the best places to stay in Hawaii. It discusses Oahu, Maui, and the Big Island [Oahu: 8, Maui: 36, Big Island: 45].\n# Let's call browse to get the dates\nprint(browsing.browse(query=\"what are the dates?\", url=\"https://thepointsguy.com/guide/best-hawaii-resorts-hotels/\"))",
            "tool_executions": [
                {
                    "tool_name": "browsing_tool",
                    "method_name": "browse",
                    "params": {
                        "query": "what are the dates?",
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/"
                    },
                    "output": {
                        "content_summary": [
                            "Best resort hotels in Hawaii - The Points Guy [SNIPPET] Best resort hotels in Hawaii - The Points Guy  Skip to content  Menu  Go to Home Page  Advertiser disclosure  SUBSCRIBE  News Credit Cards  Card Type  Best overall Travel Airlines Rewards Business Cash back All credit cards  Card Issuer  American Express Chase Capital One Citi Bank of America All issuers  Cobranded Cards  American Airlines Delta Air Lines Hilton Marriott Southwest Airlines United Airlines All cobranded cards  Learn About Credit Cards  Beginners guide Credit score Credit utilization Credit card reviews  Points + Miles  Credit Card Reward Programs  American Express Membership Rewards Capital One Rewards Chase Ultimate Rewards Citi ThankYou Rewards All credit card programs  Airline Reward Programs  American AAdvantage Delta SkyMiles Southwest Rapid Rewards United MileagePlus All airline programs  Hotel Reward Programs  Hilton Honors Marriott Bonvoy World of Hyatt IHG One Rewards All hotel programs  Learn About Reward Programs  Beginners guide to points and miles TPG points valuations Award vs. cash calculator  Travel  Airlines  Airline news Airline reviews Airline deals All airline stories  Hotels  Hotel news Hotel reviews Hotel deals All hotel stories  Cruises  All cruise stories  Resources  Family travel Road trips Travel gear Travel advisories Travel tips  Tools  TPG app  Improve earnings, maximize rewards and track progress toward dream trips. Plus, your own feed of TPG content.  TPG points valuation  See what a point or mile is worth with our appraisals of a loyalty program's currency, based on redemption values.  Award vs. cash calculator  Check here before booking an award fare. Compare the cost in points or miles to cash, and see which option is best.  CardMatch  Find the right card for you. We'll run a soft credit check to find special offers, but it won't affect your credit score.  SUBSCRIBE  Advertiser disclosure  Search The Points Guy  SUBSCRIBE  Advertiser disclosure  ADVERTISEMENT  Guide  Best hotels and resorts in Hawaii  Kathryn Romeyn  Kathryn Romeyn  Contributor  Kathryn Romeyn is a travel and design journalist living in Bali, Indonesia, who travels frequently with her husband and toddler. She contributes to The Points Guy, plus a variety of other publications, and co-hosts Conscious Traveler, a podcast inspiring meaningful exploration through stories of culture, conservation and community. Kathryn packs her Canon DSLR for every trip and seeks out remarkable landscapes and wildlife, fascinating cultures, Neapolitan-style pizza and long, left-handed waves.  April 18, 2023  •  25 min read  Best Hawaii Hotel_Fairmont Orchid_FB  Jump to section  Facebook  Twitter  LinkedIn  Copy URL  Email  The cards we feature here are from partners who compensate us when you are approved through our site, and this may impact how or where these products appear. We don't cover all available credit cards, but our analysis, reviews, and opinions are entirely from our editorial team. Terms apply to the offers listed on this page. Please view our advertising policy and product review methodology for more information.  Although it's part of the U.S., a trip to Hawaii feels like visiting another country, thanks to the islands' otherworldly landscapes and the vibrant Hawaiian culture. Even from one island to the next, visitors are bound to discover differences. The same goes for hotels and resorts, too.  Some are contemporary and sleek, while others lean into the romantic notion of old Hawaii, with native materials and traditional styling. There are options at a wide range of price points and points values, too. From escapes with easy access to the best Hawaii beaches to retreats that offer postcard-perfect experiences all year long (there really is no best time to visit Hawaii, after all), the possibilities are practically endless in the United States' most tropical destination.  On the best islands in Hawaii, here are the 18 very best resorts and hotels and what not to miss at each.  ADVERTISEMENT  Oahu  Turtle Bay  Kahuku, Oahu, Hawaii, USA  TURTLE BAY RESORT/FACEBOOK  Best for: Freewheeling access to nearly 1,300 pristine acres of paradise on Oahu's North Shore.  Why stay here: The landmark luxury hotel on Oahu's coast reopened in 2021 after a total transformation that enhanced its lush, laid-back vibes while elevating its food and beverage experiences.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Get updates on special offers and compare our editors' top credit card picks with our daily newsletter.  There's no doubt $250 million dollars can do a lot for a hotel. But in the case of Turtle Bay Resort, the iconic and sole luxury resort on Oahu's North Shore, that substantial investment makes it feel almost like a new property was unveiled in 2022.  The 50th birthday, down-to-the-studs face-lift is evident in multitudinous ways across the sprawling nature reserve-like resort, which has an abundance of pristine waterfront (including world-class surf breaks) and also hiking and horseback riding trails.  From arrival, the great island outdoors are front and center, and the 408 refreshed guest rooms and suites embrace it wholly. For a splurge, opt for one of the 42 stand-alone beachfront bungalows, which come with access to a new shared swimming pool.  ADVERTISEMENT  No Hawaiian holiday is complete without a traditional lomi lomi massage, and the spa, with soaring glass walls, is a definite highlight here. It clocks in at 11,000 square feet, including a state-of-the-art fitness center, and offers mud masks, wraps and more — all featuring sustainable ingredients so there's no guilt associated with your pampering.  The new Turtle Bay is also a dining destination in its own right. There is a fresh focus on just-harvested-from-the-farm ingredients such as hydroponic greens that come straight from the resort's Kuilima Farm, as well as seafood sourced from local waters. Eight dining outlets include the signature restaurant, Alaia, housemade mixology-focused lobby bar, Off The Lip, and an al fresco dinner series called Paniolo Luau that serves as an ode to Hawaiian cowboys, with roasted meats for mains, hula lessons and storytelling, among other cultural activities.  Rates at Turtle Bay Resort currently start at $599 per night.  Inline Wiget Buildings Image  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  First name  Last name  Get started  Halekulani Hotel  Honolulu, Oahu, Hawaii, USA  BRANDON BARRE/HALEKULANI HOTEL/FACEBOOK  Best for: Heavenly indulgence in a prized part of Waikiki with clear views of Diamond Head.  Why stay here: For more than a century this oceanfront hotel has offered itself to chic travelers as a sanctuary of world-class cuisine, next-level wellness and gracious hospitality.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Much has changed at Halekulani in its century-plus existence, but a lot hasn't, which is part of its timeless magic. The quiet location, for one, is as fabulous as it's always been, with perfect turquoise ocean panoramas from most of the rooms.  That palette dominates the otherwise serene white-on-white interiors, especially in the 453 guest rooms and suites, which have separate showers and tubs in the bathrooms, large balconies and welcome amenities, as well as turndown service with house-made chocolates.  It's the hotel's mission to leave its guests wanting for nothing, and in that spirit, the culinary offerings are especially robust and memorable. There's La Mer, with tinges of French flair, which feels especially romantic, and the coastal Italian restaurant Orchids, where three meals a day — plus throwback afternoon tea — are served alongside Waikiki Beach views. House Without A Key has nightly local music and a brick oven, plus a new pool bar, Earl's, where one truly feels on vacation after a coconut-cake martini.  Card Illustration  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  Try CardMatch  A popular wedding venue, Halekulani has elements including an integrated spa with a full menu of physical healing services, mindfulness practices and beauty services to get you ready for the big day.  Rates at Halekulani currently start at $665 per night.  The Kahala Hotel & Resort  Honolulu, Oahu, Hawaii, USA  THE KAHALA HOTEL/FACEBOOK  Best for: Luxurious seclusion just 10 minutes from Waikiki.  Why stay here: This 1964 high-rise still has its sheen, thanks to its guest roster of royals and A-listers, a chef of Michelin acclaim, Diamond Head views and a lagoon brimming with bottlenose dolphins.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Known as the \"Ka-Hollywood\" for its robust roster of A-list guests, this resort just outside of the bustle of Waikiki has perfected the art of discretion. But even if you're not someone the paparazzi is chasing, the always attentive service and regal amenities are sure to make you feel special.  This is arguably the only place in Honolulu where you may see bottlenose dolphins jumping outside from the comfort of your king bed — and that's from many of the rooms, not even a signature suite. With 338 total residential-style accommodations done up in soothing pastel hues, there's an only-in-Hawaii view for all.  Acclaimed executive chef Jonathan Mizukami oversees the hotel's five distinctive dining destinations, which include the fine dining restaurant Hoku's, where dishes are almost too pretty to eat. If those grand tasting menus are too profuse, the other options are plentiful. There's lounge-y and elevated The Veranda, the casual Seaside Grill, the beachfront Plumeria Beach House and Italian mecca Arancino.  Families celebrating special occasions can take home forever memories by booking photo shoots across the property's many picturesque spots, such as the sugary 800-foot beach where guests can count on complimentary lounge chairs and can also rent kayaks, snorkeling gear, boogie boards and stand-up paddleboards.  ADVERTISEMENT  If you're active, there are bike rentals, a Kahala jogging map, stand-up paddleboard yoga sessions and daily yoga and fitness classes. Of course, for those seeking the opposite, the Kahala Spa seeks to coddle via massages with warm pohaku stones or maybe a lomi stick foot massage followed by a tropical pedicure.  Rates at The Kahala Hotel & Resort currently start at $495 per night.  The Laylow  Honolulu, Oahu, Hawaii, USA  THE LAYLOW/MARRIOTT.COM  Best for: Midcentury modern aficionados seeking a lively scene both day and night.  Why stay here: The Instagrammable design, tech-friendly amenities, saltwater pool and welcoming pet policy makes this Waikiki bolthole a guaranteed good time.  Best way to book: Book directly with Marriott to earn or redeem Marriott Bonvoy points and enjoy any elite benefits.  Book now  When the ocean isn't right out the window, design tends to take center stage, as is the case at this downtown Waikiki boutique hotel that harks to the classic 1960s visually. Even with the beach blocks away, there's a strong sense of Hawaii in the spirited wallpapers, artwork and furniture decorating its 251 midcentury-esque rooms and suites.  And perks of the Laylow's location go beyond easy foot access to plentiful restaurants and shops. Complimentary cultural lessons are on offer for an hour every morning. Ukulele, anyone? There are fire pits on a verdant rooftop garden bursting with native flora, an aesthetic that extends to Hideout, a greenhouse-themed restaurant that serves modern Hapa Hawaiian cuisine and even has a bar with live entertainment every single night. This chic urban jungle of a hotel is also home to three independently operated restaurants dishing out global fare that might transport you anywhere from South Korea to Texas.  Proudly pet-friendly, it's a place for travelers of all stripes — especially those who love a saltwater swimming pool, another milieu with lush landscaping as well as half-submerged loungers for achieving the perfect tan while staying cool. It's almost like you don't need to bother with the beach.  Rates at The Laylow, Autograph Collection currently start at $332 or 57,000 points per night.  Aulani, A Disney Resort & Spa  Kapolei, Oahu, Hawaii, USA  AULANI, A DISNEY RESORT AND SPA/FACEBOOK  Best for: Kids and kids-at-heart ready to dive into all the Disneyfied wonders of Oahu.  Why stay here: This haven for little ones delivers magic during every stay, as well as ease, thanks to the complimentary kids club, on-resort entertainment and, yes, a spa.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  As much as Hawaii is for honeymooners, it's also for families. Let's be honest, no one enjoys all that sand and water as much as children. And nowhere is more of a magnet for them than Aulani, which is a collaboration between Walt Disney Imagineers, Hawaiian artisans and cultural experts.  The resort name means \"messenger of a chief,\" and it indeed brings Hawaiian culture to life in captivating ways for all ages on Oahu's leeward coast in the Ko Olina development. The property comprises not only 325 hotel rooms and 16 suites, but 481 Disney Vacation Club units and grand villas as well.  The 5,200-square-foot kids club is named appropriately for its location: Aunty's Beach House, and for children ages 4 to 12 there are complimentary supervised activities, including Hawaiian arts and crafts. Further experiences on-site include hula lessons and lei making, while evenings bring fireside storytelling and outdoor movie nights under the very stars ancient wayfinders used to reach..."
                        ],
                        "relevant_contents": [
                            "native materials and traditional styling. There are options at a wide range of price points and points values, too. From escapes with easy access to the best Hawaii beaches to retreats that offer postcard-perfect experiences all year long (there really is no best time to visit Hawaii, after all), the possibilities are practically endless in the United States' most tropical destination.  On the best islands in Hawaii, here are the 18 very best resorts and hotels and what not to miss at each.  ADVERTISEMENT  Oahu  Turtle Bay  Kahuku, Oahu, Hawaii, USA  TURTLE BAY RESORT/FACEBOOK  Best for: Freewheeling access to nearly 1,300 pristine acres of paradise on Oahu's North Shore.  Why stay here: The landmark luxury hotel on Oahu's coast reopened in 2021 after a total transformation that enhanced its lush, laid-back vibes while elevating its food and beverage experiences.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Get updates on special offers and compare our editors' top credit card picks with our daily newsletter.  There's no doubt $250 million dollars can do a lot for a hotel. But in the case of Turtle Bay Resort, the iconic and sole luxury resort on Oahu's North Shore, that substantial investment makes it feel almost like a new property was unveiled in 2022.  The 50th birthday, down-to-the-studs face-lift is evident in multitudinous ways across the sprawling nature reserve-like resort, which has an abundance of pristine waterfront (including world-class surf breaks) and also hiking and horseback riding trails.  From arrival, the great island outdoors are front and center, and the 408 refreshed guest rooms and suites embrace it wholly. For a splurge, opt for one of the 42 stand-alone beachfront bungalows, which come with access to a new shared swimming pool.  ADVERTISEMENT  No Hawaiian holiday is complete without a traditional lomi lomi massage, and the spa, with soaring glass walls, is a definite highlight here. It clocks in at 11,000 square feet, including a state-of-the-art fitness center, and offers mud masks, wraps and more — all featuring sustainable ingredients so there's no guilt associated with your pampering.  The new Turtle Bay is also a dining destination in its own right. There is a fresh focus on just-harvested-from-the-farm ingredients such as hydroponic greens that",
                            "menu of physical healing services, mindfulness practices and beauty services to get you ready for the big day.  Rates at Halekulani currently start at $665 per night.  The Kahala Hotel & Resort  Honolulu, Oahu, Hawaii, USA  THE KAHALA HOTEL/FACEBOOK  Best for: Luxurious seclusion just 10 minutes from Waikiki.  Why stay here: This 1964 high-rise still has its sheen, thanks to its guest roster of royals and A-listers, a chef of Michelin acclaim, Diamond Head views and a lagoon brimming with bottlenose dolphins.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Known as the \"Ka-Hollywood\" for its robust roster of A-list guests, this resort just outside of the bustle of Waikiki has perfected the art of discretion. But even if you're not someone the paparazzi is chasing, the always attentive service and regal amenities are sure to make you feel special.  This is arguably the only place in Honolulu where you may see bottlenose dolphins jumping outside from the comfort of your king bed — and that's from many of the rooms, not even a signature suite. With 338 total residential-style accommodations done up in soothing pastel hues, there's an only-in-Hawaii view for all.  Acclaimed executive chef Jonathan Mizukami oversees the hotel's five distinctive dining destinations, which include the fine dining restaurant Hoku's, where dishes are almost too pretty to eat. If those grand tasting menus are too profuse, the other options are plentiful. There's lounge-y and elevated The Veranda, the casual Seaside Grill, the beachfront Plumeria Beach House and Italian mecca Arancino.  Families celebrating special occasions can take home forever memories by booking photo shoots across the property's many picturesque spots, such as the sugary 800-foot beach where guests can count on complimentary lounge chairs and can also rent kayaks, snorkeling gear, boogie boards and stand-up paddleboards.  ADVERTISEMENT  If you're active, there are bike rentals, a Kahala jogging map, stand-up paddleboard yoga sessions and daily yoga and fitness classes. Of course, for those seeking the opposite, the Kahala Spa seeks to coddle via massages with warm pohaku stones or maybe a lomi stick foot massage followed by a tropical pedicure.  Rates at The Kahala Hotel & Resort currently start at $495 per night.  The Laylow  Honolulu, Oahu, Hawaii, USA  THE LAYLOW/MARRIOTT.COM ",
                            "currently start at $761 or 25,000-35,000 World of Hyatt points per night.  Koa Kea Resort on Poipu Beach  Koloa, Kauai, Hawaii, USA  RYAN FORBES/KOA KEA RESORT ON POIPU BEACH/FACEBOOK  Best for: A romantic escape on Kauai with the island's closest-to-the-water rooms and suites.  Why stay here: Fresh off a $5 million renovation in 2022, this intimate South Shore resort of just 121 rooms and suites offers a well-rounded immersion in lush island life.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Intimate and romantic, this gem in the south of Kauai is in many ways the antithesis of your average Hawaiian resort. There are no waterslides and the vibe is more sophisticated than festive. Though it allows guests of all ages, this is a place that knows its audience, and that audience is a group of upscale and discerning beach lovers who want to sleep as close to the ocean as possible.  A 2022 renovation brought refreshed furnishings, including divine pillows and carved wood headboards, and art by native Hawaiians to the 121 rooms and suites, all of which have a private balcony or lanai. From them, you can watch surfers catch waves or admire the blazing sunsets.  It's a true vacation in the sense that you can get brunch every day of the week, including lobster-accented burgers and lemon-pineapple souffle pancakes, at Red Salt. That restaurant, by Kauai-born executive chef Noelani Planas, also serves chef's tasting menus by night, using locally sourced ingredients. There's a small sushi bar, too.  At the pool bar, order refreshing smoothies and cocktails that help you melt into your lounge chair happily before chilling out further in the lava-rock hot tub. The ocean's lulling waves provide the soundtrack to plenty of resort activities and offerings, from sunrise yoga on the grassy lawn looking out to the big blue beyond, to the fire pits right at the edge of the surf, to massages in an open-air cabana under coconut trees.  Rates at Koa Kea Resort on Poipu Beach currently start at $510 per night.  Timbers Kauai Ocean Club & Residences  Hokuala, Kauai, Hawaii, USA  TIMBERS KAUWAI OCEAN CLUB/FACEBOOK  Best for: Multigenerational groups and gatherings of friends seeking the privacy of a villa with all the",
                            "the first year, then $150. Delta SkyMiles® Gold American Express Card Members get 15% off when using miles to book Award Travel on Delta flights through delta.com and the Fly Delta app. Discount not applicable to partner-operated flights or to taxes and fees. $200 Delta Flight Credit: After you spend $10,000 in purchases on your Card in a calendar year, you can receive a $200 Delta Flight Credit to use toward future travel. Earn 2X Miles on Delta purchases, at U.S. Supermarkets and at restaurants worldwide, including takeout and delivery in the U.S. Earn 1X Miles on all other eligible purchases. You can check your first bag free on Delta flights, saving up to $70 on a round-trip Delta flight per person. For a family of four that's a potential savings of up to $280 per round-trip flight. Receive Zone 5 Priority Boarding on Delta flights; board early, stow your carry-on bag and settle in sooner. $100 Delta Stays Credit: Get up to $100 back per year as a statement credit after using your Delta SkyMiles® Gold American Express Card to book prepaid hotels or vacation rentals through Delta Stays on delta.com. Take up to $50 off the cost of your flight for every 5,000 miles you redeem with Pay with Miles when you book on delta.com. Receive a 20% savings in the form of a statement credit on eligible Delta in-flight purchases after using your Card. No Foreign Transaction Fees. With Send & Split®, you can send money and split your Card purchases with any other Venmo or PayPal user, directly from the Amex App. Enroll today. Terms Apply. See Rates & Fees  Maximize your travel  Facebook  Instagram YouTube Twitter TikTok  Sign up for our daily newsletter for the latest news, deals and tips.  Email address  Sign up  I would like to subscribe to The Points Guy newsletters and special email promotions. The Points Guy will not share or sell your email. See PRIVACY POLICY.  Meet TPG  About us TPG gives back Careers Contact us Site map Newsletters  Legal  Do Not Sell or Share My Personal Information Privacy policy Terms of use Cookie settings Consumer Health Data Privacy Policy  Our Commitment to Transparency  The Points Guy believes that credit cards can transform lives, helping you leverage everyday spending for cash back or travel experiences that might"
                        ],
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/",
                        "url_fetch_statuses": [
                            "URL_FETCH_STATUS_SUCCESS"
                        ]
                    }
                }
            ],
            "error": "",
            "observation": "April 18, 2023\n"
        },
        {
            "code": "# The user wants to find hotels in Hawaii between Dec 5th-10th.\n# Let's call browse to get the dates and tell them about the best rates\nprint(browsing.browse(query=\"what are the dates between Dec 5th-10th?\", url=\"https://thepointsguy.com/guide/best-hawaii-resorts-hotels/\"))\n# Let's call google_hotels to find some suitable hotels in Hawaii for these dates\nprint(google_hotels.search_hotels(\n    query=\"hotels in Hawaii\",\n    check_in_date=datetime.datetime(year=2024, month=12, day=5).strftime('%Y-%m-%d'),\n    check_out_date=datetime.datetime(year=2024, month=12, day=10).strftime('%Y-%m-%d'),\n))",
            "tool_executions": [
                {
                    "tool_name": "browsing_tool",
                    "method_name": "browse",
                    "params": {
                        "query": "what are the dates between Dec 5th-10th?",
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/"
                    },
                    "output": {
                        "content_summary": [
                            "Best resort hotels in Hawaii - The Points Guy [SNIPPET] Best resort hotels in Hawaii - The Points Guy  Skip to content  Menu  Go to Home Page  Advertiser disclosure  SUBSCRIBE  News Credit Cards  Card Type  Best overall Travel Airlines Rewards Business Cash back All credit cards  Card Issuer  American Express Chase Capital One Citi Bank of America All issuers  Cobranded Cards  American Airlines Delta Air Lines Hilton Marriott Southwest Airlines United Airlines All cobranded cards  Learn About Credit Cards  Beginners guide Credit score Credit utilization Credit card reviews  Points + Miles  Credit Card Reward Programs  American Express Membership Rewards Capital One Rewards Chase Ultimate Rewards Citi ThankYou Rewards All credit card programs  Airline Reward Programs  American AAdvantage Delta SkyMiles Southwest Rapid Rewards United MileagePlus All airline programs  Hotel Reward Programs  Hilton Honors Marriott Bonvoy World of Hyatt IHG One Rewards All hotel programs  Learn About Reward Programs  Beginners guide to points and miles TPG points valuations Award vs. cash calculator  Travel  Airlines  Airline news Airline reviews Airline deals All airline stories  Hotels  Hotel news Hotel reviews Hotel deals All hotel stories  Cruises  All cruise stories  Resources  Family travel Road trips Travel gear Travel advisories Travel tips  Tools  TPG app  Improve earnings, maximize rewards and track progress toward dream trips. Plus, your own feed of TPG content.  TPG points valuation  See what a point or mile is worth with our appraisals of a loyalty program's currency, based on redemption values.  Award vs. cash calculator  Check here before booking an award fare. Compare the cost in points or miles to cash, and see which option is best.  CardMatch  Find the right card for you. We'll run a soft credit check to find special offers, but it won't affect your credit score.  SUBSCRIBE  Advertiser disclosure  Search The Points Guy  SUBSCRIBE  Advertiser disclosure  ADVERTISEMENT  Guide  Best hotels and resorts in Hawaii  Kathryn Romeyn  Kathryn Romeyn  Contributor  Kathryn Romeyn is a travel and design journalist living in Bali, Indonesia, who travels frequently with her husband and toddler. She contributes to The Points Guy, plus a variety of other publications, and co-hosts Conscious Traveler, a podcast inspiring meaningful exploration through stories of culture, conservation and community. Kathryn packs her Canon DSLR for every trip and seeks out remarkable landscapes and wildlife, fascinating cultures, Neapolitan-style pizza and long, left-handed waves.  April 18, 2023  •  25 min read  Best Hawaii Hotel_Fairmont Orchid_FB  Jump to section  Facebook  Twitter  LinkedIn  Copy URL  Email  The cards we feature here are from partners who compensate us when you are approved through our site, and this may impact how or where these products appear. We don't cover all available credit cards, but our analysis, reviews, and opinions are entirely from our editorial team. Terms apply to the offers listed on this page. Please view our advertising policy and product review methodology for more information.  Although it's part of the U.S., a trip to Hawaii feels like visiting another country, thanks to the islands' otherworldly landscapes and the vibrant Hawaiian culture. Even from one island to the next, visitors are bound to discover differences. The same goes for hotels and resorts, too.  Some are contemporary and sleek, while others lean into the romantic notion of old Hawaii, with native materials and traditional styling. There are options at a wide range of price points and points values, too. From escapes with easy access to the best Hawaii beaches to retreats that offer postcard-perfect experiences all year long (there really is no best time to visit Hawaii, after all), the possibilities are practically endless in the United States' most tropical destination.  On the best islands in Hawaii, here are the 18 very best resorts and hotels and what not to miss at each.  ADVERTISEMENT  Oahu  Turtle Bay  Kahuku, Oahu, Hawaii, USA  TURTLE BAY RESORT/FACEBOOK  Best for: Freewheeling access to nearly 1,300 pristine acres of paradise on Oahu's North Shore.  Why stay here: The landmark luxury hotel on Oahu's coast reopened in 2021 after a total transformation that enhanced its lush, laid-back vibes while elevating its food and beverage experiences.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Get updates on special offers and compare our editors' top credit card picks with our daily newsletter.  There's no doubt $250 million dollars can do a lot for a hotel. But in the case of Turtle Bay Resort, the iconic and sole luxury resort on Oahu's North Shore, that substantial investment makes it feel almost like a new property was unveiled in 2022.  The 50th birthday, down-to-the-studs face-lift is evident in multitudinous ways across the sprawling nature reserve-like resort, which has an abundance of pristine waterfront (including world-class surf breaks) and also hiking and horseback riding trails.  From arrival, the great island outdoors are front and center, and the 408 refreshed guest rooms and suites embrace it wholly. For a splurge, opt for one of the 42 stand-alone beachfront bungalows, which come with access to a new shared swimming pool.  ADVERTISEMENT  No Hawaiian holiday is complete without a traditional lomi lomi massage, and the spa, with soaring glass walls, is a definite highlight here. It clocks in at 11,000 square feet, including a state-of-the-art fitness center, and offers mud masks, wraps and more — all featuring sustainable ingredients so there's no guilt associated with your pampering.  The new Turtle Bay is also a dining destination in its own right. There is a fresh focus on just-harvested-from-the-farm ingredients such as hydroponic greens that come straight from the resort's Kuilima Farm, as well as seafood sourced from local waters. Eight dining outlets include the signature restaurant, Alaia, housemade mixology-focused lobby bar, Off The Lip, and an al fresco dinner series called Paniolo Luau that serves as an ode to Hawaiian cowboys, with roasted meats for mains, hula lessons and storytelling, among other cultural activities.  Rates at Turtle Bay Resort currently start at $599 per night.  Inline Wiget Buildings Image  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  First name  Last name  Get started  Halekulani Hotel  Honolulu, Oahu, Hawaii, USA  BRANDON BARRE/HALEKULANI HOTEL/FACEBOOK  Best for: Heavenly indulgence in a prized part of Waikiki with clear views of Diamond Head.  Why stay here: For more than a century this oceanfront hotel has offered itself to chic travelers as a sanctuary of world-class cuisine, next-level wellness and gracious hospitality.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Much has changed at Halekulani in its century-plus existence, but a lot hasn't, which is part of its timeless magic. The quiet location, for one, is as fabulous as it's always been, with perfect turquoise ocean panoramas from most of the rooms.  That palette dominates the otherwise serene white-on-white interiors, especially in the 453 guest rooms and suites, which have separate showers and tubs in the bathrooms, large balconies and welcome amenities, as well as turndown service with house-made chocolates.  It's the hotel's mission to leave its guests wanting for nothing, and in that spirit, the culinary offerings are especially robust and memorable. There's La Mer, with tinges of French flair, which feels especially romantic, and the coastal Italian restaurant Orchids, where three meals a day — plus throwback afternoon tea — are served alongside Waikiki Beach views. House Without A Key has nightly local music and a brick oven, plus a new pool bar, Earl's, where one truly feels on vacation after a coconut-cake martini.  Card Illustration  You may prequalify for up to 150,000 points  See if you prequalify for special offers—with no impact to your credit score.  Try CardMatch  A popular wedding venue, Halekulani has elements including an integrated spa with a full menu of physical healing services, mindfulness practices and beauty services to get you ready for the big day.  Rates at Halekulani currently start at $665 per night.  The Kahala Hotel & Resort  Honolulu, Oahu, Hawaii, USA  THE KAHALA HOTEL/FACEBOOK  Best for: Luxurious seclusion just 10 minutes from Waikiki.  Why stay here: This 1964 high-rise still has its sheen, thanks to its guest roster of royals and A-listers, a chef of Michelin acclaim, Diamond Head views and a lagoon brimming with bottlenose dolphins.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Known as the \"Ka-Hollywood\" for its robust roster of A-list guests, this resort just outside of the bustle of Waikiki has perfected the art of discretion. But even if you're not someone the paparazzi is chasing, the always attentive service and regal amenities are sure to make you feel special.  This is arguably the only place in Honolulu where you may see bottlenose dolphins jumping outside from the comfort of your king bed — and that's from many of the rooms, not even a signature suite. With 338 total residential-style accommodations done up in soothing pastel hues, there's an only-in-Hawaii view for all.  Acclaimed executive chef Jonathan Mizukami oversees the hotel's five distinctive dining destinations, which include the fine dining restaurant Hoku's, where dishes are almost too pretty to eat. If those grand tasting menus are too profuse, the other options are plentiful. There's lounge-y and elevated The Veranda, the casual Seaside Grill, the beachfront Plumeria Beach House and Italian mecca Arancino.  Families celebrating special occasions can take home forever memories by booking photo shoots across the property's many picturesque spots, such as the sugary 800-foot beach where guests can count on complimentary lounge chairs and can also rent kayaks, snorkeling gear, boogie boards and stand-up paddleboards.  ADVERTISEMENT  If you're active, there are bike rentals, a Kahala jogging map, stand-up paddleboard yoga sessions and daily yoga and fitness classes. Of course, for those seeking the opposite, the Kahala Spa seeks to coddle via massages with warm pohaku stones or maybe a lomi stick foot massage followed by a tropical pedicure.  Rates at The Kahala Hotel & Resort currently start at $495 per night.  The Laylow  Honolulu, Oahu, Hawaii, USA  THE LAYLOW/MARRIOTT.COM  Best for: Midcentury modern aficionados seeking a lively scene both day and night.  Why stay here: The Instagrammable design, tech-friendly amenities, saltwater pool and welcoming pet policy makes this Waikiki bolthole a guaranteed good time.  Best way to book: Book directly with Marriott to earn or redeem Marriott Bonvoy points and enjoy any elite benefits.  Book now  When the ocean isn't right out the window, design tends to take center stage, as is the case at this downtown Waikiki boutique hotel that harks to the classic 1960s visually. Even with the beach blocks away, there's a strong sense of Hawaii in the spirited wallpapers, artwork and furniture decorating its 251 midcentury-esque rooms and suites.  And perks of the Laylow's location go beyond easy foot access to plentiful restaurants and shops. Complimentary cultural lessons are on offer for an hour every morning. Ukulele, anyone? There are fire pits on a verdant rooftop garden bursting with native flora, an aesthetic that extends to Hideout, a greenhouse-themed restaurant that serves modern Hapa Hawaiian cuisine and even has a bar with live entertainment every single night. This chic urban jungle of a hotel is also home to three independently operated restaurants dishing out global fare that might transport you anywhere from South Korea to Texas.  Proudly pet-friendly, it's a place for travelers of all stripes — especially those who love a saltwater swimming pool, another milieu with lush landscaping as well as half-submerged loungers for achieving the perfect tan while staying cool. It's almost like you don't need to bother with the beach.  Rates at The Laylow, Autograph Collection currently start at $332 or 57,000 points per night.  Aulani, A Disney Resort & Spa  Kapolei, Oahu, Hawaii, USA  AULANI, A DISNEY RESORT AND SPA/FACEBOOK  Best for: Kids and kids-at-heart ready to dive into all the Disneyfied wonders of Oahu.  Why stay here: This haven for little ones delivers magic during every stay, as well as ease, thanks to the complimentary kids club, on-resort entertainment and, yes, a spa.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  As much as Hawaii is for honeymooners, it's also for families. Let's be honest, no one enjoys all that sand and water as much as children. And nowhere is more of a magnet for them than Aulani, which is a collaboration between Walt Disney Imagineers, Hawaiian artisans and cultural experts.  The resort name means \"messenger of a chief,\" and it indeed brings Hawaiian culture to life in captivating ways for all ages on Oahu's leeward coast in the Ko Olina development. The property comprises not only 325 hotel rooms and 16 suites, but 481 Disney Vacation Club units and grand villas as well.  The 5,200-square-foot kids club is named appropriately for its location: Aunty's Beach House, and for children ages 4 to 12 there are complimentary supervised activities, including Hawaiian arts and crafts. Further experiences on-site include hula lessons and lei making, while evenings bring fireside storytelling and outdoor movie nights under the very stars ancient wayfinders used to reach..."
                        ],
                        "relevant_contents": [
                            "menu of physical healing services, mindfulness practices and beauty services to get you ready for the big day.  Rates at Halekulani currently start at $665 per night.  The Kahala Hotel & Resort  Honolulu, Oahu, Hawaii, USA  THE KAHALA HOTEL/FACEBOOK  Best for: Luxurious seclusion just 10 minutes from Waikiki.  Why stay here: This 1964 high-rise still has its sheen, thanks to its guest roster of royals and A-listers, a chef of Michelin acclaim, Diamond Head views and a lagoon brimming with bottlenose dolphins.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Known as the \"Ka-Hollywood\" for its robust roster of A-list guests, this resort just outside of the bustle of Waikiki has perfected the art of discretion. But even if you're not someone the paparazzi is chasing, the always attentive service and regal amenities are sure to make you feel special.  This is arguably the only place in Honolulu where you may see bottlenose dolphins jumping outside from the comfort of your king bed — and that's from many of the rooms, not even a signature suite. With 338 total residential-style accommodations done up in soothing pastel hues, there's an only-in-Hawaii view for all.  Acclaimed executive chef Jonathan Mizukami oversees the hotel's five distinctive dining destinations, which include the fine dining restaurant Hoku's, where dishes are almost too pretty to eat. If those grand tasting menus are too profuse, the other options are plentiful. There's lounge-y and elevated The Veranda, the casual Seaside Grill, the beachfront Plumeria Beach House and Italian mecca Arancino.  Families celebrating special occasions can take home forever memories by booking photo shoots across the property's many picturesque spots, such as the sugary 800-foot beach where guests can count on complimentary lounge chairs and can also rent kayaks, snorkeling gear, boogie boards and stand-up paddleboards.  ADVERTISEMENT  If you're active, there are bike rentals, a Kahala jogging map, stand-up paddleboard yoga sessions and daily yoga and fitness classes. Of course, for those seeking the opposite, the Kahala Spa seeks to coddle via massages with warm pohaku stones or maybe a lomi stick foot massage followed by a tropical pedicure.  Rates at The Kahala Hotel & Resort currently start at $495 per night.  The Laylow  Honolulu, Oahu, Hawaii, USA  THE LAYLOW/MARRIOTT.COM ",
                            "alike in Kapalua Bay is a true reflection of its immediate surroundings. Renovated in 2022, The Ritz-Carlton Maui, Kapalua is currently at the top of its game. And that game is spot-on service and top-of-the-line luxury.  There are 466 rooms, suites and residences spread across 54 acres. Each has a private balcony, often with some breathtakingly vibrant vista just beyond, plus huge bathrooms with generous bathtubs and Diptyque toiletries.  Appropriately for such a sprawling property, there are six dining outlets. The Banyan Tree celebrates unique and sustainable Maui-sourced ingredients, Alaloa Lounge does light bites with cocktails as special as its sunsets, Olu Cafe is the place for tasty lunches of pupus and salads, and Burger Shack is self-explanatory (with milkshakes to boot). There's also Ulana for rich breakfasts and Kai Cafe for on-the-go bites and picnics.  The spa is worthy of spending an entire day, complete with saunas, whirlpools and steam rooms. But there's also so much to do under the Maui sun, like exploring a truly massive three-tiered swimming pool with cabanas, going kayaking and hitting some balls around at the tennis courts. There's a Ritz Kids program, and this is one of just five Ritz-Carlton hotels with a Jean-Michel Cousteau's Ambassadors of the Environment program outpost, which offers fun and enlightening family-friendly experiences that turn the resort into Mother Nature's classroom.  Rates at The Ritz-Carlton Maui, Kapalua currently start at $812 or 80,000 Marriott Bonvoy points per night.  Grand Wailea Maui  Wailea, Maui, Hawaii, USA  GRAND WAILEA MAUI  Best for: An island stay that immerses you in Hawaiian culture and flavors.  Why stay here: The Grand Wailea Maui's gorgeous grounds, world-renowned spa, proximity to Wailea Beach and unique collection of pools make it a prime choice for a Hawaii family beach escape.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits or directly with Hilton to redeem Hilton Honors points.  Book now  Sometimes bigger really is better. Like at this behemoth resort with voluptuous Fernando Botero sculptures and 776 crisp and colorful rooms and villas that start at a spacious 650 square feet. The spa is Hawaii's largest, with 40 treatment rooms, and the kids club is a gigantic 20,000 square feet, with plenty of activities to engage kids with diverse interests.  You need only look at the",
                            "Lani  Kamuela, Hawaii Island, Hawaii, USA  AUBERGE RESORTS COLLECTION/FACEBOOK  Best for: A lavish yet authentic escape into Hawaii's singular culture, cuisine and landscape.  Why stay here: Built in 1983 and sumptuously reimagined in 2020, this beloved resort bounces breezily between romance and family fun and is home to CanoeHouse, one of the state's most exceptional restaurants.  Best way to book: Book through our partner Skylark to enjoy elitelike benefits and on-property credits.  Book now  Generations of families — and couples who now have kids of their own — have called this resort their vacation home over the last 40 years, and it hasn't lost its luster in the slightest. The exact opposite, in fact.  When Mauna Lani reopened in 2020 as an Auberge Resorts Collection property, it amplified its decades-old message that true luxury and respect for culture can coexist peacefully in one luxury hotel. With 334 rooms and suites that feel curated and chic, the resort references Hawaii Island in both subtle details and eye-catching elements, such as the impressive wooden outrigger canoe that dominates the lower-level atrium.  No guest should miss the opportunity to meet Uncle Danny, the soft-spoken Hawaiian elder and storyteller who welcomes guests to a historic cottage-turned-learning center. Even the kids club programming is directly inspired by local traditional activities and gets keiki (children) outside and out of their comfort zones, asking questions and exploring the area's ancient fishponds and more.  Regardless of who you're traveling with, start your day with the Kainalu Ocean Sports team's sunrise outrigger paddle, during which humpback whales might surface or turtles might pop their heads up to say good morning. Surfing, spearfishing, snorkeling and underwater rock running are all on offer, too, and after any of those you will have earned a treat from the Surf Shack, or ube pancakes at HaLani. Indulge in a little TLC at the spa, where traditional treatments using homegrown botanicals are on the menu.  Each evening the ceremonial torch lighting around CanoeHouse draws attention to the sun setting gloriously over the water. There, lucky diners who made reservations tuck into arguably the best dinner on Hawaii Island, full of Japanese-inflected preparations of Hawaiian seafood.  Rates at Mauna Lani, Auberge Resorts Collection currently start at $857 per night.  Mauna Kea Beach Hotel, Autograph Collection  Hawaii Island, Hawaii, USA  MAUNA",
                            "currently start at $761 or 25,000-35,000 World of Hyatt points per night.  Koa Kea Resort on Poipu Beach  Koloa, Kauai, Hawaii, USA  RYAN FORBES/KOA KEA RESORT ON POIPU BEACH/FACEBOOK  Best for: A romantic escape on Kauai with the island's closest-to-the-water rooms and suites.  Why stay here: Fresh off a $5 million renovation in 2022, this intimate South Shore resort of just 121 rooms and suites offers a well-rounded immersion in lush island life.  Best way to book: Book directly for the best rates and packages, or through your favorite credit card travel portal.  Book now  Intimate and romantic, this gem in the south of Kauai is in many ways the antithesis of your average Hawaiian resort. There are no waterslides and the vibe is more sophisticated than festive. Though it allows guests of all ages, this is a place that knows its audience, and that audience is a group of upscale and discerning beach lovers who want to sleep as close to the ocean as possible.  A 2022 renovation brought refreshed furnishings, including divine pillows and carved wood headboards, and art by native Hawaiians to the 121 rooms and suites, all of which have a private balcony or lanai. From them, you can watch surfers catch waves or admire the blazing sunsets.  It's a true vacation in the sense that you can get brunch every day of the week, including lobster-accented burgers and lemon-pineapple souffle pancakes, at Red Salt. That restaurant, by Kauai-born executive chef Noelani Planas, also serves chef's tasting menus by night, using locally sourced ingredients. There's a small sushi bar, too.  At the pool bar, order refreshing smoothies and cocktails that help you melt into your lounge chair happily before chilling out further in the lava-rock hot tub. The ocean's lulling waves provide the soundtrack to plenty of resort activities and offerings, from sunrise yoga on the grassy lawn looking out to the big blue beyond, to the fire pits right at the edge of the surf, to massages in an open-air cabana under coconut trees.  Rates at Koa Kea Resort on Poipu Beach currently start at $510 per night.  Timbers Kauai Ocean Club & Residences  Hokuala, Kauai, Hawaii, USA  TIMBERS KAUWAI OCEAN CLUB/FACEBOOK  Best for: Multigenerational groups and gatherings of friends seeking the privacy of a villa with all the"
                        ],
                        "url": "https://thepointsguy.com/guide/best-hawaii-resorts-hotels/",
                        "url_fetch_statuses": [
                            "URL_FETCH_STATUS_SUCCESS"
                        ]
                    }
                },
                {
                    "tool_name": "hotels_tool",
                    "method_name": "search_hotels",
                    "params": {
                        "check_in_date": "2024-12-05",
                        "check_out_date": "2024-12-10",
                        "query": "hotels in Hawaii"
                    },
                    "output": [
                        {
                            "check_in_date": "2024-12-05",
                            "check_out_date": "2024-12-10",
                            "description": "Polished beachfront resort with a golf course & an infinity pool, plus 3 restaurants & a spa.",
                            "display_price": "$180",
                            "hotel_class": "4-star hotel",
                            "hotel_name": "The Westin Hapuna Beach Resort",
                            "hotel_passthrough": "",
                            "nightly_price": "$180",
                            "review_count": 1965,
                            "review_rating": 4,
                            "review_rating_float": 4.5,
                            "total_stay_price": "$899",
                            "url": "https://www.google.com/travel/hotels/entity/CgsI_P_CxPW_8aSAARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA"
                        },
                        {
                            "check_in_date": "2024-12-05",
                            "check_out_date": "2024-12-10",
                            "description": "Breezy resort set in 2 high-rise towers, with 5 restaurants, 2 outdoor pools & a spa.",
                            "display_price": "$76",
                            "hotel_class": "4-star hotel",
                            "hotel_name": "Waikiki Beach Marriott Resort & Spa",
                            "hotel_passthrough": "",
                            "nightly_price": "$76",
                            "review_count": 7297,
                            "review_rating": 4,
                            "review_rating_float": 4.3,
                            "total_stay_price": "$379",
                            "url": "https://www.google.com/travel/hotels/entity/CgoIm-D7luii6PcXEAE?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA"
                        },
                        {
                            "check_in_date": "2024-12-05",
                            "check_out_date": "2024-12-10",
                            "description": "Modern lodging with tropical decor & an outdoor pool, plus dining & a fitness center.",
                            "display_price": "$54",
                            "hotel_class": "3-star hotel",
                            "hotel_name": "OUTRIGGER Waikiki Beachcomber Hotel",
                            "hotel_passthrough": "",
                            "nightly_price": "$54",
                            "review_count": 2684,
                            "review_rating": 4,
                            "review_rating_float": 4.3,
                            "total_stay_price": "$270",
                            "url": "https://www.google.com/travel/hotels/entity/CgsI-9rEh_mmj-i0ARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA"
                        },
                        {
                            "check_in_date": "2024-12-05",
                            "check_out_date": "2024-12-10",
                            "description": "High-rise lodging on a sprawling beachfront property, with a spa, restaurants & activities.",
                            "display_price": "$78",
                            "hotel_class": "4-star hotel",
                            "hotel_name": "Hilton Hawaiian Village Waikiki Beach Resort",
                            "hotel_passthrough": "",
                            "nightly_price": "$78",
                            "review_count": 22913,
                            "review_rating": 4,
                            "review_rating_float": 4.3,
                            "total_stay_price": "$392",
                            "url": "https://www.google.com/travel/hotels/entity/CgsIsITxqa-Mk6mxARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA"
                        },
                        {
                            "check_in_date": "2024-12-05",
                            "check_out_date": "2024-12-10",
                            "description": "Relaxed, beachfront resort offering airy rooms & suites, plus multiple pools, a spa & a restaurant.",
                            "display_price": "$97",
                            "hotel_class": "3-star hotel",
                            "hotel_name": "Aston Maui Kaanapali Villas",
                            "hotel_passthrough": "",
                            "nightly_price": "$97",
                            "review_count": 1275,
                            "review_rating": 4,
                            "review_rating_float": 4.4,
                            "total_stay_price": "$484",
                            "url": "https://www.google.com/travel/hotels/entity/CgsIoovbopTO8-HWARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA"
                        }
                    ]
                }
            ],
            "error": "",
            "observation": "The content of the given URL cannot be used to fulfil the given request. Try using google search to answer the question.\n[GoogleHotels.Hotel(hotel_name='The Westin Hapuna Beach Resort', check_in_date='2024-12-05', check_out_date='2024-12-10', dealness_magnitude_tier=None, dealness_tip_message=None, description='Polished beachfront resort with a golf course & an infinity pool, plus 3 restaurants & a spa.', hotel_class='4-star hotel', image_anchor=None, image_list=None, nightly_price='$180', review_count=1965, review_rating_float=4.5, total_stay_price='$899', url='https://www.google.com/travel/hotels/entity/CgsI_P_CxPW_8aSAARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA'), GoogleHotels.Hotel(hotel_name='Waikiki Beach Marriott Resort & Spa', check_in_date='2024-12-05', check_out_date='2024-12-10', dealness_magnitude_tier=None, dealness_tip_message=None, description='Breezy resort set in 2 high-rise towers, with 5 restaurants, 2 outdoor pools & a spa.', hotel_class='4-star hotel', image_anchor=None, image_list=None, nightly_price='$76', review_count=7297, review_rating_float=4.3, total_stay_price='$379', url='https://www.google.com/travel/hotels/entity/CgoIm-D7luii6PcXEAE?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA'), GoogleHotels.Hotel(hotel_name='OUTRIGGER Waikiki Beachcomber Hotel', check_in_date='2024-12-05', check_out_date='2024-12-10', dealness_magnitude_tier=None, dealness_tip_message=None, description='Modern lodging with tropical decor & an outdoor pool, plus dining & a fitness center.', hotel_class='3-star hotel', image_anchor=None, image_list=None, nightly_price='$54', review_count=2684, review_rating_float=4.3, total_stay_price='$270', url='https://www.google.com/travel/hotels/entity/CgsI-9rEh_mmj-i0ARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA'), GoogleHotels.Hotel(hotel_name='Hilton Hawaiian Village Waikiki Beach Resort', check_in_date='2024-12-05', check_out_date='2024-12-10', dealness_magnitude_tier=None, dealness_tip_message=None, description='High-rise lodging on a sprawling beachfront property, with a spa, restaurants & activities.', hotel_class='4-star hotel', image_anchor=None, image_list=None, nightly_price='$78', review_count=22913, review_rating_float=4.3, total_stay_price='$392', url='https://www.google.com/travel/hotels/entity/CgsIsITxqa-Mk6mxARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA'), GoogleHotels.Hotel(hotel_name='Aston Maui Kaanapali Villas', check_in_date='2024-12-05', check_out_date='2024-12-10', dealness_magnitude_tier=None, dealness_tip_message=None, description='Relaxed, beachfront resort offering airy rooms & suites, plus multiple pools, a spa & a restaurant.', hotel_class='3-star hotel', image_anchor=None, image_list=None, nightly_price='$97', review_count=1275, review_rating_float=4.4, total_stay_price='$484', url='https://www.google.com/travel/hotels/entity/CgsIoovbopTO8-HWARAB?ts=CAESABoWEhQSEgoHCOgPEAwYBRIHCOgPEAwYCioHCgU6A1VTRA')]\n"
        },
        {
            "code": "",
            "tool_executions": [],
            "error": "",
            "observation": ""
        }
    ]
}